<?php

namespace Database\Seeders;

use App\Models\Industry;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class IndustrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $industries = [
            'حسابرسی',
            'بانکداری',
            'سرمایه‌گذاری و مالی',
            'کالاهای مصرفی و تند گردش',
            'کالاهای الکتریکی و لوازم خانگی',
            'خودرو و صنایع وابسته',
            'فناوری اطلاعات / نرم‌افزار و سخت‌افزار',
            'اینترنت / تجارت الکترونیک / خدمات آنلاین',
            'تلکام',
            'تولیدی / صنعتی',
            'نفت، گاز و پتروشیمی',
            'انرژی / نیروگاهی',
            'تجارت / بازرگانی',
            'خدمات درمانی و سلامتی',
            'تجهیزات پزشکی',
            'دارو',
            'آرایشگاه / کلینیک زیبایی',
            'مد و کالاهای لوکس',
            'خرده‌فروشی / مرکز خرید / فروشگاه',
            'حمل‌ونقل / ترابری',
            'خطوط هوایی / هوانوردی',
            'کشتیرانی',
            'گردشگری / هتلداری',
            'کترینگ / رستوران / واحدهای غذایی',
            'خدمات برگزاری همایش، مجالس، سمینار و نمایشگاه',
            'شرکت‌های خدماتی / پیمانکاران',
            'خدمات مهندسی و تخصصی',
            'طراحی / گرافیک / هنر',
            'معماری',
            'خدمات سازمانی / مشاوره مدیریت',
            'بازاریابی و تبلیغات',
            'رسانه / چاپ و نشر',
            'کشاورزی',
            'ساختمان / مصالح و تجهیزات ساختمانی',
            'آموزش / پژوهش',
            'بیمه',
            'حقوقی و قضایی',
            'املاک و مستغلات',
            'ورزشی / تفریح و سرگرمی',
            'ترجمه',
            'بخش دولتی',
            'خیریه / موسسات غیرانتفاعی / سازمان‌های مردم‌نهاد',
            'تکنولوژی و نوآوری / سرمایه‌گذاری خطرپذیر / شتاب‌دهنده',
            'بازی و سرگرمی',
            'معدن',
            'EPC / ساخت',
        ];

        foreach ($industries as $industryName) {
            Industry::firstOrCreate(['name' => $industryName]);
        }
    }
}
